In [1]:
import pandas as pd
import numpy as np

In [2]:
# los df de Pandas entienden NaN y None como nulos

In [138]:
df = (pd.DataFrame({'VarA':['aa', None, 'cc', None],
                    'VarB':[20,30,None, None],
                    'VarC':[1234,3456,6789,765],
                    'VarD':[1234,888,None, None]}, 
                  index = ['case1', 'case2', 'case3', 'case4']))
df

       VarA  VarB  VarC    VarD
case1    aa  20.0  1234  1234.0
case2  None  30.0  3456   888.0
case3    cc   NaN  6789     NaN
case4  None   NaN   765     NaN

### cambiar nombre de las variables

In [107]:
df.rename(columns={'VarA':'vara', 'VarB':'varb', 'VarC':'varc', 'VarD': 'vard'})

       vara  varb  varc    vard
case1    aa  20.0  1234  1234.0
case2  None  30.0  3456   888.0
case3    cc   NaN  6789     NaN
case4  None   NaN   765     NaN

In [139]:
df.rename(columns= lambda name: name.lower(), inplace=True)

## estudio nulos

In [11]:
# estudiar si hay algún nulo en nuestra dataset

# si devuelve True es que por lo menos hay un nulo en el dataset

df.isnull().values.any()

True

In [37]:
# ver qué columnas tienen nulos

df_nulos = df.isnull().any().reset_index()

In [43]:
# cómo crear lista de variables con nulos

# método 1:

lista_var_con_nulos = (df_nulos[df_nulos[0]==True] #filtramos por los True
                       ['index'] #tomamos la columna 'index'
                       .tolist()) #transformamos de series a lista

In [64]:
# método 2:

boolean_null = df.isnull().any().tolist()
columnas = list(df)

columnas_con_nulos = []
for columna, boolean in zip(columnas, boolean_null):
    if boolean == True:
        columnas_con_nulos.append(columna)
columnas_con_nulos

['vara', 'varb', 'vard']

In [67]:
# método 2 pero con list comprehension

columnas_con_nulos = [columna for columna,boolean in zip(columnas, boolean_null) if boolean]

In [72]:
#método 3

[key for key, value in dict(df.isnull().any()).items() if value ]

['vara', 'varb', 'vard']

In [76]:
columnas_con_nulos

['vara', 'varb', 'vard']

## filtrar un dataframe

In [79]:
df[df.vara == 'aa']

      vara  varb  varc    vard
case1   aa  20.0  1234  1234.0

In [81]:
df[(df.vara =='aa') | (df.vara =='cc')]

      vara  varb  varc    vard
case1   aa  20.0  1234  1234.0
case3   cc   NaN  6789     NaN

In [88]:
df[df.vara.isnull()]

       vara  varb  varc   vard
case2  None  30.0  3456  888.0
case4  None   NaN   765    NaN

In [90]:
df[(df.vara.isnull()) & (df.varb.isnull())]

       vara  varb  varc  vard
case4  None   NaN   765   NaN

In [91]:
df[pd.isnull(df.vara)]

       vara  varb  varc   vard
case2  None  30.0  3456  888.0
case4  None   NaN   765    NaN

In [93]:
import pandas as pd

## estudiar porcentaje de nulos en las columnas

In [128]:
df

       vara  varb  varc    vard
case1    aa  20.0  1234  1234.0
case2  None  30.0  3456   888.0
case3    cc   NaN  6789     NaN
case4  None   NaN   765     NaN

In [127]:
#rellena TODOS los nulos
df.fillna(0)

      vara  varb  varc    vard
case1   aa  20.0  1234  1234.0
case2    0  30.0  3456   888.0
case3   cc   0.0  6789     0.0
case4    0   0.0   765     0.0

In [130]:
df.fillna(value={'vara':0, 'varb':-14.32})

      vara   varb  varc    vard
case1   aa  20.00  1234  1234.0
case2    0  30.00  3456   888.0
case3   cc -14.32  6789     NaN
case4    0 -14.32   765     NaN

In [131]:
df

       vara  varb  varc    vard
case1    aa  20.0  1234  1234.0
case2  None  30.0  3456   888.0
case3    cc   NaN  6789     NaN
case4  None   NaN   765     NaN

In [97]:
num_rows = len(df)
porcentaje_nulos = []
for columna in columnas_con_nulos:
    num_nulls = len(df[df[columna].isnull()])
    porcentaje = num_nulls*100/num_rows
    porcentaje_nulos.append((columna, porcentaje))
    print("La columna {0} tiene un {1}% de nulos.\n".format(columna, porcentaje))

La columna vara tiene un 50.0% de nulos.

La columna varb tiene un 50.0% de nulos.

La columna vard tiene un 50.0% de nulos.

In [98]:
porcentaje_nulos

[('vara', 50.0), ('varb', 50.0), ('vard', 50.0)]

In [121]:
df

       vara  varb  varc    vard
case1    aa  20.0  1234  1234.0
case2  None  30.0  3456   888.0
case3    cc   NaN  6789     NaN
case4  None   NaN   765     NaN

In [122]:
porcentaje_limite = 60

for columna, porcentaje in porcentaje_nulos:
    if porcentaje > porcentaje_limite:
        df = df.drop(columna, axis=1) #si supera límite de nulos variable entera fuera
    else: df = df[df[columna].notnull()] # si está por debajo del límite filtramos registros

In [146]:
# manera equivalente

porcentaje_limite = 0.6

for columna in columnas_con_nulos:
    df = df.dropna(axis=1, thresh=porcentaje_limite*num_rows) #multiplicamos porque pide num entero
    #eliminar todas las columnas que tengan mayor porcentaje de nulos que el límite

df = df.dropna() #eliminamos registros con nulos que todavía están presentes